tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "xz"
brew "asciiquarium"
brew "atuin"
brew "openssl@3"
brew "bat"
brew "bottom"
brew "broot"
brew "catimg"
brew "chafa"
brew "cmake"
brew "dotenv-linter"
brew "portaudio"
brew "espeak"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitui"
brew "glfw"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "mysql"
brew "neo4j"
brew "utf8proc", args: ["HEAD"]
brew "neovim"
brew "node"
brew "node@18"
brew "node@20"
brew "openblas"
brew "opencode"
brew "pgvector"
brew "pipdeptree"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-setuptools"
brew "python@3.12"
brew "tcl-tk"
brew "python-tk@3.12"
brew "python@3.13"
brew "python-tk@3.13"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ranger"
brew "redis"
brew "sk"
brew "starship"
brew "stow"
brew "tach"
brew "tesseract"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "uv"
brew "w3m"
brew "watchexec"
brew "webpack"
brew "wget"
brew "yarn"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
cask "chromedriver"
cask "codex"
cask "dotnet-sdk"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "miniconda"
cask "vscodium"
cask "zed"
cargo "cargo-deny"
cargo "sqlx-cli"
cargo "tauri-cli"
cargo "trunk"
cargo "wasm-pack"
